# YOLOv12 🚀  (Turbo backbone + AMC2fLEFEM neck/head)
# Built for Ultralytics ≥ 8.2
# Modified May 2025 – replaces every A2C2f in the detection head with the new
# AMC2fLEFEM block (C2f + LEF + FEM + SimAM).
# --------------------------------------------------------------------------- #
# NOTE ─ Channel numbers (64, 128 … 1024, 512, 256) are **scaled automatically**
#        by the `width` multiplier in the `scales:` table, exactly like the
#        original YOLO‑v12‑turbo config.  You don’t have to touch them for n/s/m/l/x.
# --------------------------------------------------------------------------- #

# ------------------------------- globals ----------------------------------- #
nc: 1          # number of classes

scales:    # [depth_multiplier, width_multiplier, max_channels]
  n: [0.50, 0.25, 1024]    # 6.2 GFLOPs
  s: [0.50, 0.50, 1024]    # 19.7 GFLOPs
  m: [0.50, 1.00,  512]    # 60.4 GFLOPs
  l: [1.00, 1.00,  512]    # 83.3 GFLOPs
  x: [1.00, 1.50,  512]    # 185.9 GFLOPs

# ------------------------------- backbone ---------------------------------- #
# --- backbone identical to v12‑n -------------------------------------------------

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]
  - [-1, 1, Conv,   [128, 3, 2, 1, 2]]
  - [-1, 2, C3k2,   [256, False, 0.25]]
  - [-1, 1, Conv,   [256, 3, 2, 1, 4]]
  - [-1, 2, C3k2,   [512, False, 0.25]]
  - [-1, 1, Conv,   [512, 3, 2]]
  - [-1, 4, A2C2f,  [512, True, 4]]
  - [-1, 1, Conv,   [1024, 3, 2]]
  - [-1, 4, A2C2f,  [1024, True, 1]]

# --- neck/head with compressed AMC2fLEFEM ----------------------------------------

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, AMC2fLEFEM,  [512, True, 0.75]]   # scales to 128 @ ‑n

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, AMC2fLEFEM,  [256, True, 0.75]]   # → 64

  - [-1, 1, Conv,       [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, AMC2fLEFEM,  [512, True, 0.75]]   # → 128

  - [-1, 1, Conv,       [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2,       [1024, True]]

  - [[14, 17, 20], 1, Detect, [nc]]
